<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.amonteith2.jamf.VisualStudioCode-patch</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Development</string>
		<key>PATCH_TARGET_GROUP_NAME</key>
		<string>Smart-update-Visual Studio Code</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplateTest.xml</string>
		<key>NAME</key>
		<string>Visual Studio Code</string>
		<key>PATCH_ENABLED</key>
		<string>true</string>
		<key>PATCH_GRACE</key>
		<string>20</string>
		<key>PATCH_ICON_POLICY_NAME</key>
		<string>App - %NAME%</string>
		<key>PATCH_NAME</key>
		<string>%NAME% Patch Policy</string>
		<key>PATCH_SOFTWARE_TITLE</key>
		<string>Microsoft Visual Studio Code</string>
		<key>PATCH_TEMPLATE</key>
		<string>PatchTemplate-selfservice.xml</string>
		<key>PATCH_UNKNOWN</key>
		<string>true</string>
		<key>POLICY_NAME</key>
		<string>App - %NAME%</string>
		<key>SOFTWARE_TITLE</key>
		<string>Microsoft Visual Studio Code</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Staff Macs - All</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.amonteith2.pkg.visualstudioscode</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%PATCH_TARGET_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>patch_icon_policy_name</key>
				<string>%PATCH_ICON_POLICY_NAME%</string>
				<key>patch_name</key>
				<string>%PATCH_NAME%</string>
				<key>patch_softwaretitle</key>
				<string>%PATCH_SOFTWARE_TITLE%</string>
				<key>patch_template</key>
				<string>%PATCH_TEMPLATE%</string>
				<key>replace_patch</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		</dict>
	</array>
</dict>
</plist>
