<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of jamovi and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.amonteith2.pkg.jamovi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jamovi</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.jamovi</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>id</key>
			<string>org.jamovi.jamovi</string>
			<key>options</key>
			<string>purge_ds_store</string>
			<key>pkgname</key>
			<string>%NAME%-%version%</string>
			<key>pkgroot</key>
			<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			<key>pkgtype</key>
			<string>flat</string>
		</dict>
	</array>
</dict>
</plist>
