Identifier: com.github.amonteith2.jamf.pgadmin-patch
ParentRecipe: com.github.amonteith2.pkg.pgadmin
MinimumVersion: '2.3'

Input:
  NAME: pgAdmin 4
  SOFTWARE_TITLE: '%NAME%'
  CATEGORY: Development
  GROUP_NAME: 'Smart-update-%NAME%'
  GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  TESTING_GROUP_NAME: TEST - am21 Macs
  PATCH_NAME: '%NAME% Patch Policy'
  PATCH_SOFTWARE_TITLE: pgAdmin 4
  PATCH_TEMPLATE: 'PatchTemplate-selfservice.xml'
  POLICY_NAME: 'App - %NAME%'
  PATCH_ENABLED: 'true'
  PATCH_UNKNOWN: 'true'
  PATCH_GRACE: '20'
  PATCH_ICON_POLICY_NAME: '%POLICY_NAME%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
  Arguments:
    patch_name: '%PATCH_NAME%'
    patch_template: '%PATCH_TEMPLATE%'
    patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
    patch_icon_policy_name: '%PATCH_ICON_POLICY_NAME%'
    replace_patch: 'True'
