Comment: Uploads a pckage to Jamf and creates a policy to deploy the software to a specified group in Self Service.
Identifier: com.github.amonteith2.jamf.zoom-upload-policy
ParentRecipe: com.github.amonteith2.zoom.us.pkg
MinimumVersion: '2.3'

Input:
  NAME: 'Zoom'
  CATEGORY: 'Staff - App'
  POLICY_CATEGORY: 'Commiunications'
  POLICY_NAME: 'App - %NAME%'
  POLICY_TEMPLATE: ZoomSelfServicePolicyTemplate.xml
  GROUP_NAME: 'TEST Macs - am21'
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%NAME%.png'
  SELF_SERVICE_DESCRIPTION: 'Installs Zoom and is set to use the Universities accounts for authentication.&#13;
&#13;
Updates should happen automatically without user intervention required.&#13;
&#13;
A Configuration profile should be added to your device to allow screen sharing.  You will then need to allow this in System Preferences.&#13;
&#13;
-Open System Preferences&#13;
-Select Security &amp; Privacy&#13;
-Scroll down the list on the left-hand side till you get to Screen Recording&#13;
-Tick the box for zoom.us.'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT:  'Install'  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
