Comment: Recipe automatically generated from com.github.jss-recipes.jss.Zoom by JamfRecipeMaker
Identifier: com.github.amonteith2.zoom.us.jamf
ParentRecipe: com.github.amonteith2.zoom.us.pkg
MinimumVersion: '2.3'

Input:
  NAME: zoom.us
  CATEGORY: Productivity
  POLICY_CATEGORY: Staff
  POLICY_NAME: App-%NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Zoom lets you do video calls.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
