Comment: Recipe automatically generated from com.github.jss-recipes.jss.Zoom by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.zoom.us-pkg-upload
ParentRecipe: ccom.github.amonteith2.zoom.us.pkg
MinimumVersion: '2.3'

Input:
  NAME: zoom.us
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
