Description: Should just upload the Office package to Jamf.  Should.
Identifier: com.github.amonteith2.MicrosoftOffice.jamf
ParentRecipe: com.github.rtrouton.pkg.MicrosoftOffice365Suite
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Office
  CATEGORY: Productivity
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
