Comment: Shamelessly pilfered from com.github.autopkg.grahampugh-recipes.jamf.VisualStudioCode and altered to personalise for our institution
Identifier: com.github.amonteith2.jamf.MicrosoftOfficeBuisnessPro
ParentRecipe: com.github.amonteith2.pkg.MicrosoftOffice365BusinessProSuite
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Office
  CATEGORY: Productivity
  POLICY_CATEGORY: Staff - App
  POLICY_NAME: 'Install Office - Self Service'
  POLICY_TEMPLATE: Policy-install-SelfService.xml
  SELF_SERVICE_DISPLAY_NAME: Install %NAME%
  SELF_SERVICE_DESCRIPTION: It's Office.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == True
  GROUP_NAME: 'Staff Macs - All'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    INSTALL_BUTTON_TEXT: 'Install'
    REINSTALL_BUTTON_TEXT: 'Reinstall'
    replace_policy: 'True'
    POLICY_RUN_COMMAND: 'sudo jamf recon'
