Comment: Shamelessly pilfered from com.github.autopkg.grahampugh-recipes.jamf.VisualStudioCode and altered to personalise for our institution
Identifier: com.github.amonteith2.jamf.MicrosoftOfficeBuisnessPro
ParentRecipe: com.github.rtrouton.pkg.MicrosoftOffice365BusinessProSuite
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Office
  CATEGORY: Productivity
  #GROUP_NAME: Smart-update-%NAME%
  #GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  #TESTING_GROUP_NAME: TEST - am21 Macs
  POLICY_CATEGORY: Staff - App
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Staff - App - %NAME%
  SELF_SERVICE_DESCRIPTION: Visual Studio Code is a source code editor which includes support for debugging, embedded Git control, syntax highlighting, intelligent code completion, snippets, and code refactoring.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

#- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
#  Arguments:
#    computergroup_name: '%GROUP_NAME%'
#    computergroup_template: '%GROUP_TEMPLATE%'
#    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
