Comment: Uploads a pckage to Jamf and creates a policy to deploy the software to a specified group in Self Service.
Identifier: com.github.amonteith2.jamf.VSCode-upload-editpolicy
ParentRecipe: com.github.killahquam.pkg.visualstudioscode
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  CATEGORY: Development
  POLICY_CATEGORY: Staff - App
  POLICY_NAME: App - %NAME%
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  GROUP_NAME: 'IS Support Staff Macs'
  SELF_SERVICE_DISPLAY_NAME: %NAME%
  SELF_SERVICE_DESCRIPTION: Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.
  SELF_SERVICE_ICON: '%NAME%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT:  'Install'
  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
