Comment: Shamelessly pilfered from com.github.autopkg.grahampugh-recipes.jamf.VisualStudioCode and altered to personalise for our institution
Identifier: com.github.amonteith2.jamf.VisualStudioCode
ParentRecipe: com.github.killahquam.pkg.visualstudioscode
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  CATEGORY: Productivity
  GROUP_NAME: Visual Studio Code-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  TESTING_GROUP_NAME: TEST - am21 Macs
  POLICY_CATEGORY: Staff - App - %NAME%
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Visual Studio Code is a source code editor which includes support for debugging, embedded Git control, syntax highlighting, intelligent code completion, snippets, and code refactoring.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

Comment: - Processor: StopProcessingIf
Comment:   Arguments:
Comment:     predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
