Identifier: com.github.amonteith2.jamf.VisualStudioCode-patch
ParentRecipe: com.github.amonteith2.jamf.VSCode-upload-editpolicy
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  SOFTWARE_TITLE: Microsoft Visual Studio Code
  CATEGORY: Development
  GROUP_NAME: Smart-update-Visual Studio Code
  GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  TESTING_GROUP_NAME: TEST - am21 Macs
  PATCH_NAME: '%NAME%'
  PATCH_SOFTWARE_TITLE: Microsoft Visual Studio Code
  PATCH_TEMPLATE: 'PatchTemplate-selfservice.xml'
  POLICY_NAME: Visual Studio Code Patch Policy
  PATCH_ENABLED: 'true'
  PATCH_UNKNOWN: 'true'
  PATCH_GRACE: '20'
  PATCH_ICON_POLICY_NAME: '%NAME%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
  Arguments:
    patch_name: '%PATCH_NAME%'
    patch_template: '%PATCH_TEMPLATE%'
    patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
    patch_icon_policy_name: '%PATCH_ICON_POLICY_NAME%'
