<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates installer package from downloaded QGIS dmg.</string>
    <key>Identifier</key>
    <string>com.github.amonteith2.pkg.qgis.recipe</string>
    <key>Input</key>
    <dict>
        <key></key>
        <string></string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.amonteith2.download.qgis.recipe</string>
    <key>Process</key>
        <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
    </dict>
    </array>
</dict>
</plist>
