Identifier: com.github.amonteith2.jamf.qgis-upload-editpolicy
ParentRecipe: com.github.amonteith2.pkg.qgis.recipe
MinimumVersion: '2.3'

Input:
  NAME: QGIS
  CATEGORY: Productivity
  POLICY_CATEGORY: 'Staff - App'
  POLICY_NAME: 'App - %NAME%'
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  GROUP_NAME: 'Staff Macs - All'
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_DESCRIPTION: QGIS is a free and open-source cross-platform desktop geographic information system application that supports viewing, editing, printing, and analysis of geospatial data.
  SELF_SERVICE_ICON: '%NAME%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT:  'Install'
  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
