<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
	<string>Pilfered from hansen-m and tried to add the AppIconExtractor processor</string>
	<key>Description</key>
    <string>Downloads the latest RStudio installer package.</string>
    <key>Identifier</key>
    <string>com.github.amonteith2.download.RStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RStudio</string>
        <key>SEARCH_URL</key>
        <string>https://www.rstudio.com/products/rstudio/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;dmg&gt;RStudio-(?P&lt;version&gt;([0-9.]+){1,3}?.*).dmg)</string>
        <key>DOWNLOAD_MIRROR</key>
        <string>https://download1.rstudio.org/desktop/macos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_MIRROR%/%dmg%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/RStudio.app</string>
                <key>requirement</key>
                <string>identifier "org.rstudio.RStudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FYF2F5GFX4</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
