Coment: Uploads a pckage to Jamf and creates a policy to deploy the software to a specified group in Self Service.
Identifier: com.github.amonteith2.jamf.RStudio-upload-editpolicy
ParentRecipe: com.github.amonteith2.pkg.RStudio
MinimumVersion: '2.3'

Input:
  NAME: RStudio
  CATEGORY: Statistics
  POLICY_CATEGORY: 'Staff - App'
  POLICY_NAME: 'App - %NAME%'
  POLICY_TEMPLATE: Policy_Install_Sel-fService_incVersion.xml
  GROUP_NAME: 'Staff Macs - All'
  SELF_SERVICE_DISPLAY_NAME: 'Install latest %NAME%'
  SELF_SERVICE_DESCRIPTION: The RStudio IDE is a set of integrated tools designed to help you be more productive with R and Python. It includes a console, syntax-highlighting editor that supports direct code execution, and a variety of robust tools for plotting, viewing history, debugging and managing your workspace.
  SELF_SERVICE_ICON: '%NAME%.png'
  INSTALL_BUTTON_TEXT: 'Install v'
  REINSTALL_BUTTON_TEXT:  'Install v'
  POLICY_RUN_COMMAND: Install
  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
