<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RStudio and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.amonteith2.icon.RStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.amonteith2.pkg.RStudio</string>
	<key>Process</key>
	<array>
    <dict>
		  <key>Processor</key>
			<string>com.github.haircut.processors/AppIconExtractor</string>
			<key>Arguments</key>
			<dict>
				<key>source_app</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			</dict>
		</dict>
  </array>
</dict>
</plist>
