Comment: Pilfered from someone else.
Identifier: com.github.amonteith2.OneDrive.jamf
ParentRecipe: corp.sap.maccoe.pkg.microsoftuniversalonedrive
MinimumVersion: '2.3'

Input:
  NAME: OneDrive
  CATEGORY: Productivity
  POLICY_CATEGORY: 'Internet'
  POLICY_NAME: 'App - %NAME%'
  GROUP_NAME: 'Staff Macs - All'
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_DESCRIPTION: 'App for team working and communication'
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT:  'Install'
  POLICY_RUN_COMMAND: 'Install'
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
