Coment: Uploads a pckage to Jamf and creates a policy to deploy the software to a specified group in Self Service.
Identifier: com.github.amonteith2.jamf.<APP NAME>-upload-editpolicy
ParentRecipe: <IDENTIFIER OF PARENT RECIPE>
MinimumVersion: '2.3'

Input:
  NAME: <APP NAME>
  CATEGORY: <APP CATEGORY>
  POLICY_CATEGORY: <POLICY CATEGORY>
  POLICY_NAME: <NAME OF POLICY>
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  GROUP_NAME: <NAME OF GROUP TO ADVERTISE TO>
  SELF_SERVICE_DISPLAY_NAME: Install latest %NAME%
  SELF_SERVICE_DESCRIPTION: <INSERT BLURB HERE>
  SELF_SERVICE_ICON: '%NAME%.png'
  INSTALL_BUTTON_TEXT: 'Install v'
  REINSTALL_BUTTON_TEXT:  'Install v'
  POLICY_RUN_COMMAND: Install
  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
