Description: Adds the newly-downloaded installer for MS Defender ATP to Jamf and includes it in the policy that installs it on newly-enrolled devices in place of the old version. 
Identifier: com.github.amonteith2.jamf.microsoftdefender
ParentRecipe: com.github.amonteith2.pkg.microsoftdefender

Input:
  NAME: Microsoft Defender
  CATEGORY: Staff
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

