Description: Adds the newly-downloaded installer for MS Defender ATP to Jamf and includes it in the policy that installs it on newly-enrolled devices in place of the old version. 
Identifier: com.github.amonteith2.jamf.microsoftdefender
ParentRecipe: com.github.amonteith2.pkg.microsoftdefender

Input:
  NAME: Microsoft Defender
  SOFTWARE_TITLE: Android_Studio
  CATEGORY: Security
  ARCHITECTURE: 'arm64'
  GROUP_CRITERIA: '%ARCHITECTURE%'
  GROUP_NAME: 'Architecture - %ARCHITECTURE%'
  GROUP_TEMPLATE: 'SmartGroup-architecture-smart.xml'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: PolicyTemplate.xml
  POLICY_NAME: 'Install Latest %NAME% (%ARCHITECTURE%)'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: Install the latest version of Microsoft Defender.
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'


Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

 - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'
      
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: '%POLICY_TEMPLATE%'
    policy_name: '%POLICY_NAME%'
    icon: '%SELF_SERVICE_ICON%'
      
