<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Uploads a pckage to Jamf and creates a policy to deploy the software to a specified group in Self Service.</string>
	<key>Identifier</key>
	<string>com.github.amonteith2.jamf.NVivo-upload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>Staff Macs - All</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>NAME</key>
		<string>NVivo</string>
		<key>POLICY_CATEGORY</key>
		<string>Staff - App</string>
		<key>POLICY_NAME</key>
		<string>App - %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>NVivoSelfServicePolicyTemplate.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>NVivo is a qualitative data analysis (QDA) computer software package produced by Lumivero (formerly by QSR International). NVivo helps qualitative researchers to organize, analyze and find insights in unstructured or qualitative data like interviews, open-ended survey responses, journal articles, social media and web content, where deep levels of analysis on small or large volumes of data are required.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.amonteith2.pkg.NVivo</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
