Comment: Set ARCHITECTURE to x86_64 or arm64
Identifier: com.github.amonteith2.jamf.Asana
ParentRecipe: com.github.amonteith2.pkg.Asana
MinimumVersion: '2.3'

Input:
  NAME: Asana
  SOFTWARE_TITLE: Asana
  CATEGORY: Development
  #ARCHITECTURE: 'arm64'
  #GROUP_CRITERIA: '%ARCHITECTURE%'
  #GROUP_NAME: 'Architecture - %ARCHITECTURE%'
  GROUP_TEMPLATE: 'JamfSmartGroupTemplateTest.xml'
  POLICY_CATEGORY: Productivity
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  POLICY_NAME: 'App - %NAME%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: Install the latest version of Asana.
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
