Identifier: com.github.amonteith2.jamf.GoogleChrome-patch
ParentRecipe: com.github.amonteith2.jamf.GoogleChrome-upload-editpolicy
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  SOFTWARE_TITLE: Chrome
  CATEGORY: Internet
  PATCH_NAME: '%NAME%'
  PATCH_SOFTWARE_TITLE: '%NAME%'
  PATCH_TEMPLATE: 'PatchTemplate-selfservice.xml'
  POLICY_NAME: '%NAME% Patch Policy'
  PATCH_ENABLED: 'true'
  PATCH_UNKNOWN: 'true'
  PATCH_GRACE: '20'
  PATCH_ICON_POLICY_NAME: '%NAME%'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      patch_name: '%PATCH_NAME%'
      patch_template: '%PATCH_TEMPLATE%'
      patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
      patch_icon_policy_name: '%PATCH_ICON_POLICY_NAME%'
