Comment: Copied from com.github.autopkg.grahampugh-recipes.jamf.GoogleChrome-pkg-upload with the intention of personalisng it for our Jamf setup.
Identifier: com.github.amonteith2.jamf.GoogleChrome-upload-editpolicy
ParentRecipe: com.github.amonteith2.autopkg.doitall.googlechrome
MinimumVersion: '2.3'

Input:
  NAME: Chrome
  CATEGORY: Internet
  POLICY_CATEGORY: Staff - App
  POLICY_NAME: Chrome enterprise for staff
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  SELF_SERVICE_DISPLAY_NAME: Install latest %NAME%
  SELF_SERVICE_DESCRIPTION: Chrome updates automatically to run smooth & secure with the latest features.
  SELF_SERVICE_ICON: '%NAME%.png'
  INSTALL_BUTTON_TEXT: 'Install v'
  REINSTALL_BUTTON_TEXT:  'Install v'
  
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
