<policy>
  <general>
    <name>%POLICY_NAME%</name>
    <enabled>true</enabled>
    <frequency>Ongoing</frequency>
    <category>
      <name>%CATEGORY%</name>
    </category>
  </general>
  <scope>
    <all_computers>false</all_computers>
    <computer_groups>
      <computer_group>
        <name>%GROUP_NAME%</name>
      </computer_group>
    </computer_groups>
  </scope>
  <self_service>
    <use_for_self_service>true</use_for_self_service>
    <self_service_display_name>%NAME%</self_service_display_name>
    <install_button_text>%INSTALL_BUTTON_TEXT% - %version%<</install_button_text>
    <reinstall_button_text>%REINSTALL_BUTTON_TEXT% - %version%<</reinstall_button_text>
    <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    <force_users_to_view_description>true</force_users_to_view_description>
    <self_service_categories>
      <category>
        <name>%POLICY_CATEGORY%</name>
      </category>
    </self_service_categories>
  </self_service>
<package_configuration>
		<packages>
			<size>1</size>
			<package>
				<name>%pkg_name%</name>
				<action>Install</action>
			</package>
		</packages>
	</package_configuration>
  <scripts>
    <size>1</size>
    <script>
      <name>App - Activate NVivo v20</name>
      <priority>After</priority>
    </script>
  </scripts>
  <maintenance>
    <recon>true</recon>
  </maintenance>
</policy>
