<policy>
  <general>
    <name>%POLICY_NAME%</name>
    <enabled>true</enabled>
    <frequency>Ongoing</frequency>
    <category>
      <name>%CATEGORY%</name>
    </category>
  </general>
  <scope>
    <all_computers>false</all_computers>
    <computer_groups>
      <computer_group>
        <name>%GROUP_NAME%</name>
      </computer_group>
    </computer_groups>
    <exclusions>
      <computer_groups>
        <computer_group>
          <name>%EXCLUSION_GROUP%</name>
        </computer_group>
      </computer_groups>
    </exclusions>
  </scope>
  <self_service>
    <use_for_self_service>true</use_for_self_service>
    <self_service_display_name>%NAME%</self_service_display_name>
    <install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
    <reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
    <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    <force_users_to_view_description>true</force_users_to_view_description>
    <self_service_categories>
      <category>
        <name>%POLICY_CATEGORY%</name>
      </category>
    </self_service_categories>
  </self_service>
  <package_configuration>
    <packages>
      <size>3</size>
      <package>
        <name>%pkg_name%</name>
      </package>
      <package>
        <name>%INSTALL_PACKAGE_2%</name>
      </package>
      <package>
        <name>%INSTALL_PACKAGE_3%</name>
      </package>
    </packages>
  </package_configuration>
  <scripts>
    <size>0</size>
  </scripts>
  <maintenance>
    <recon>true</recon>
  </maintenance>
</policy>
