Description: iTerm2 is a terminal emulator for macOS, licensed under GPL-2.0-or-later. It was derived from and has mostly supplanted the earlier "iTerm" application.
Identifier: com.github.amonteith2.iTerm.jamf
ParentRecipe: io.github.hjuutilainen.pkg.iTerm2
MinimumVersion: '2.3'

Input:
  NAME: iTerm2
  CATEGORY: Productivity
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
