<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of iTerm2 and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.amonteith2.pkg.iTerm2</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>iTerm</string>
		<key>NAME</key>
		<string>iTerm2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.amonteith2.download.iTerm2</string>
	<key>Process</key>
	<array>
			<dict>
				<key>Processor</key>
				<string>com.github.haircut.processors/AppIconExtractor</string>
				<key>Arguments</key>
				<dict>
					<key>source_app</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
				</dict>
			</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/iTerm.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
	
</dict>
</plist>
