Identifier: com.github.amonteith2.jamf.R-pkg-upload
ParentRecipe: com.github.homebysix.pkg.R
MinimumVersion: '2.3'

Input:
  NAME: R
  CATEGORY: Statistics
  PATCH_TARGET_GROUP_NAME: Smart-update-%NAME%
  GROUP_NAME: Smart-update-%NAME%
  GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  TESTING_GROUP_NAME: Staff Macs - All
  POLICY_CATEGORY: Staff - App
  POLICY_NAME: App - %NAME%
  POLICY_TEMPLATE: Policy_Install_SelfService_incVersion.xml
  SELF_SERVICE_DISPLAY_NAME: Install latest %NAME%
  SELF_SERVICE_DESCRIPTION: R is a free software environment for statistical computing and graphics.
  SELF_SERVICE_ICON: R.png
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

#- Processor: StopProcessingIf
#  Arguments:
#    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
    install_button_text: 'Install - %VERSION%'
