Identifier: com.github.amonteith2.jamf.R-patch
ParentRecipe: com.github.grahampugh.recipes.pkg.R
MinimumVersion: '2.3'

Input:
  NAME: R
  SOFTWARE_TITLE: 'R for Statistical Computing'
  CATEGORY: Statistics
  PATCH_TARGET_GROUP_NAME: 'Smart-update-%NAME%'
  GROUP_TEMPLATE: JamfSmartGroupTemplateTest.xml
  TESTING_GROUP_NAME: 'Staff Macs - All'
  PATCH_NAME: 'Patch Policy - %NAME%'
  PATCH_SOFTWARE_TITLE: 'R for Statistical Computing'
  PATCH_TEMPLATE: 'PatchTemplate-selfservice.xml'
  POLICY_NAME: 'App - %NAME%'
  PATCH_ENABLED: 'true'
  PATCH_UNKNOWN: 'true'
  PATCH_GRACE: '20'
  PATCH_ICON_POLICY_NAME: '%POLICY_NAME%'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
  Arguments:
    patch_name: '%PATCH_NAME%'
    patch_template: '%PATCH_TEMPLATE%'
    patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
    patch_icon_policy_name: '%PATCH_ICON_POLICY_NAME%'
    replace_patch: 'True'
